docs/API.org
#+TITLE: API Reference
#+AUTHOR: llmII
#+DATE: 2025-12-04

* Overview

Jsec provides production-quality TLS/DTLS integration for Janet. The APIs are
designed to closely follow Janet's standard conventions:

- *TLS streams* implement Janet's full stream interface (~ev/read~, ~ev/write~,
  ~ev/chunk~, ~ev/close~) with identical signatures. TLS streams can be used
  anywhere Janet streams are expected - no special-casing required.

- *DTLS* follows Janet's UDP conventions (~net/recv-from~, ~net/send-to~) for
  the server-side API, and stream conventions for 1:1 client connections.

This design allows TLS/DTLS to be a drop-in replacement in existing code.

** Janet Stream API Compatibility

TLS streams are designed to be fully compatible with Janet's stream API. This
means:

1. *Same function signatures*: ~ev/read~, ~ev/write~, ~ev/chunk~, ~ev/close~
   work identically on TLS streams as they do on plain TCP streams.

2. *Drop-in replacement*: Code written for ~net/connect~ can use ~tls/connect~
   with no other changes. Generic stream-processing functions work unchanged.

3. *Optional parameter convention*: Where Janet stream functions accept one
   optional parameter (e.g., timeout), jsec accepts either:
   - The original type (number for timeout)
   - A table/struct containing that parameter and optionally TLS-specific options

4. *Only initialization differs*: ~tls/connect~ vs ~net/connect~ and
   ~tls/listen~/~tls/accept~ vs ~net/listen~/~net/accept~ have different
   signatures to accommodate TLS options.

#+begin_src janet
# These work identically on TLS or plain TCP streams:
(ev/read stream 1024)              # Read up to 1024 bytes
(ev/write stream "hello")          # Write data
(ev/chunk stream 100)              # Read exactly 100 bytes
(ev/close stream)                  # Close with proper shutdown

# Generic stream function - works with any stream type
(defn echo-handler [stream]
  (while-let [data (ev/read stream 4096)]
    (ev/write stream data)))

# Works with plain TCP
(echo-handler (net/connect "localhost" "8080"))

# Works with TLS - no changes needed
(echo-handler (tls/connect "localhost" "8443" {:verify false}))
#+end_src

* Modules

- ~jsec/tls~: TCP/TLS operations (Client & Server). Implements full Janet stream interface.
- ~jsec/dtls~: UDP/DTLS operations (Client & Server). Follows Janet UDP conventions.
- ~jsec/cert~: Certificate generation utilities.
- ~jsec/bio~: Basic I/O abstraction (memory BIOs).
- ~jsec/crypto~: Cryptographic primitives (hashing, signing).

For working examples of all functionality, see the [[file:../examples/][examples directory]].

* Module: jsec/tls

** (tls/new-context opts)

Create a reusable TLS context.

- *opts*: Table/struct.
  - ~:cert~: Path to certificate (PEM) or PEM content (string/buffer).
  - ~:key~: Path to private key (PEM) or PEM content (string/buffer).
  - ~:verify~: Boolean (default ~true~ for client).
  - ~:ca-file~: Path to CA certificate file or PEM content (string/buffer).
  - ~:ca-path~: Path to CA certificate directory.
  - ~:security~: Security options.
  - ~:alpn~: List of ALPN protocols (e.g. ~["h2" "http/1.1"]~).
  - ~:sni~: (Server only) Table of hostname -> options for virtual hosting.
    Example: ~{"example.com" {:cert "..." :key "..."}}~.

*Returns*: A TLS context object.

*Example*: See [[file:../examples/echo_server.janet][echo_server.janet]] for context creation and reuse.

