docs/API.org
** (tls/connect host port &opt opts)

Connect to a TLS server.

- *host*: String (hostname or IP) or ~:unix~ for Unix sockets.
- *port*: String (port number) or path for Unix sockets.
- *opts*: Optional table/struct OR a TLS context object.
  - If a context is passed, it is used for the connection.
  - If a table is passed:
    - ~:verify~: Boolean (default ~true~). Verify server certificate.
    - ~:hostname~: String. SNI hostname. Defaults to ~host~ for TCP, "localhost" for Unix.
    - ~:verify-hostname~: String. Hostname to verify against certificate (defaults to ~:hostname~).
    - ~:session~: Byte string. Session data for resumption (from ~get-session~).
    - ~:cert~: String/buffer. Client certificate (PEM) for mTLS.
    - ~:key~: String/buffer. Client private key (PEM) for mTLS.
    - ~:trusted-cert~: String/buffer. Trust specific cert (for self-signed servers).
    - ~:buffer-size~: Integer. Internal TLS buffer size (default 16384).
    - ~:tcp-nodelay~: Boolean. Enable TCP_NODELAY (default ~true~).
    - ~:handshake-timing~: Boolean. Track handshake duration (default ~false~).
    - ~:security~: Table. Security options (see [[*Security Options][Security Options]]).
    - ~:alpn~: List of ALPN protocols.
    - ~:ca-file~: Path to CA certificate file or PEM content (string/buffer).
    - ~:ca-path~: Path to CA certificate directory.

*Returns*: A TLS stream object.

*Examples*:
- [[file:../examples/simple_https_client.janet][simple_https_client.janet]] - Basic HTTPS GET request
- [[file:../examples/session_resumption.janet][session_resumption.janet]] - Using session resumption
- [[file:../examples/mtls_client_server.janet][mtls_client_server.janet]] - Mutual TLS authentication

** (tls/listen host port &opt opts)

Create a TCP listener. This is a wrapper around ~net/listen~.

- *host*: Bind address.
- *port*: Bind port.
- *opts*: Optional table.
  - ~:backlog~: Integer. Listen backlog (default 1024).

*Returns*: A listener object.

** (tls/accept listener opts)

Accept a connection from a listener and perform the TLS handshake.

- *listener*: Listener object from ~tls/listen~.
- *opts*: Table/struct OR a TLS context object.
  - If a context is passed, it is used for the connection.
  - If a table is passed:
    - ~:cert~: String. Path to server certificate (PEM) or PEM content (string/buffer).
    - ~:key~: String. Path to private key (PEM) or PEM content (string/buffer).
    - ~:verify~: Boolean (default ~false~). Require and verify client certificate (mTLS).
    - ~:trusted-cert~: String/buffer. Trust specific client certificate (for mTLS with self-signed).
    - ~:ca~: String. Path to CA file for client certificate verification.
    - ~:buffer-size~: Integer. Internal TLS buffer size (default 16384).
    - ~:tcp-nodelay~: Boolean. Enable TCP_NODELAY (default ~true~).
    - ~:handshake-timing~: Boolean. Track handshake duration (default ~false~).
    - ~:security~: Table. Security options.
    - ~:alpn~: List of ALPN protocols.
    - ~:ca-file~: Path to CA certificate file (for mTLS) or PEM content.
    - ~:ca-path~: Path to CA certificate directory (for mTLS).

*Returns*: A TLS stream object.

** (tls/accept-loop listener context handler)

Continuously accept TLS connections on a listener.

- *listener*: Listener object from ~tls/listen~.
- *context*: TLS context object OR options table (same as ~tls/accept~).
  - Can include ~:buffer-size~, ~:tcp-nodelay~, ~:handshake-timing~.
- *handler*: Function taking a TLS stream.

*Returns*: The listener stream (when closed).

** (tls/upgrade stream hostname &opt opts)

Upgrade an existing plaintext stream to TLS (STARTTLS).

- *stream*: Existing connected ~JanetStream~.
- *hostname*: String. SNI hostname.
- *opts*: Optional table (same as ~connect~).

*Returns*: A TLS stream object. *Note*: The original stream is consumed.

*Example*: See [[file:../examples/starttls_smtp.janet][starttls_smtp.janet]] for SMTP STARTTLS upgrade.

** (tls/wrap stream &opt hostname-or-opts opts)

Wrap an existing stream with TLS. Used for both client and server modes.

*Client mode* (provides hostname):
- *stream*: Existing connected ~JanetStream~.
- *hostname-or-opts*: String. SNI hostname.
- *opts*: Optional table:
  - ~:verify~: Boolean (default ~true~). Verify server certificate.
  - ~:cert~: String/buffer. Client certificate (PEM) for mTLS.
  - ~:key~: String/buffer. Client private key (PEM) for mTLS.
  - ~:trusted-cert~: String/buffer. Trust specific cert (for self-signed).
  - ~:session~: Buffer. Session data for resumption.
  - ~:buffer-size~: Integer. Internal TLS buffer size.
  - ~:tcp-nodelay~: Boolean. Enable TCP_NODELAY (default ~true~).
  - ~:handshake-timing~: Boolean. Track handshake duration (default ~false~).
  - ~:security~: Table. Security options.
  - ~:alpn~: List of ALPN protocols.

*Server mode* (provides cert/key):
- *stream*: Existing connected ~JanetStream~ from ~:accept~.
- *hostname-or-opts*: Table/struct with:
  - ~:cert~: String/buffer. Server certificate (PEM). Required.
  - ~:key~: String/buffer. Server private key (PEM). Required.
  - ~:verify~: Boolean. If ~true~, require client certificate (mTLS).
  - ~:trusted-cert~: String/buffer. Trust specific client cert.
  - ~:ca~: String. Path to CA file for client cert verification.
  - ~:buffer-size~: Integer. Internal TLS buffer size.
  - ~:tcp-nodelay~: Boolean. Enable TCP_NODELAY (default ~true~).
  - ~:handshake-timing~: Boolean. Track handshake duration (default ~false~).
  - ~:security~: Table. Security options.
  - ~:alpn~: List of ALPN protocols.

*Returns*: A TLS stream object.

*Examples*:
#+begin_src janet
# Client mode - connect with client certificate (mTLS)
(def tls (tls/wrap tcp-stream "example.com" 
           {:cert client-cert :key client-key :verify false}))

# Server mode - require client certificate (mTLS)
(def tls (tls/wrap accepted-stream 
           {:cert server-cert :key server-key 
            :verify true :trusted-cert client-cert}))
#+end_src

** Stream Methods (Janet Stream API Compatible)

TLS streams implement Janet's standard stream interface. They work with:

- ~ev/read~ / ~:read~ - Read data from the stream
- ~ev/write~ / ~:write~ - Write data to the stream  
- ~ev/chunk~ / ~:chunk~ - Read exactly n bytes or until EOF
- ~ev/close~ / ~:close~ - Close with proper TLS shutdown

*** (ev/read stream n &opt buf timeout)

Read up to ~n~ bytes from the TLS stream.

- *stream*: TLS stream object
- *n*: Maximum bytes to read
- *buf*: Optional buffer to read into
- *timeout*: Optional timeout in seconds

*Returns*: Buffer with data, or ~nil~ on EOF.

*** (ev/write stream data &opt timeout)

Write data to the TLS stream.

- *stream*: TLS stream object
- *data*: String or buffer to write
- *timeout*: Optional timeout in seconds

*Returns*: ~nil~

*** (ev/chunk stream n &opt buf timeout)

Read exactly ~n~ bytes, or until EOF.

- *stream*: TLS stream object
- *n*: Exact number of bytes to read
- *buf*: Optional buffer to read into
- *timeout*: Optional timeout in seconds

*Returns*: Buffer with data.

*** (ev/close stream)

Close the TLS stream with proper RFC-compliant shutdown.

Performs async bidirectional close_notify exchange before closing the
underlying transport. Safe to use with Janet's ~with~ macro.

- *stream*: TLS stream object

*Note*: For unresponsive peers, use ~(:close stream true)~ to force immediate
close without TLS shutdown.

