docs/API.org
** TLS Stream Methods (via jsec/tls-stream)

These methods are available on TLS stream objects. Access via method syntax
~(:method stream args...)~ or import ~jsec/tls-stream~ for function versions.

*** Connection Information

- ~(:connection-info stream)~ or ~(tls-stream/connection-info stream)~
  Returns a struct with connection details:
  - ~:version~: TLS version (e.g., "TLSv1.3")
  - ~:cipher~: Cipher suite name
  - ~:cipher-bits~: Cipher strength
  - ~:alpn~: Negotiated ALPN protocol
  - ~:server-name~: SNI hostname

- ~(:version stream)~ or ~(tls-stream/version stream)~
  Returns TLS version string (e.g., "TLSv1.3")

- ~(:cipher stream)~ or ~(tls-stream/cipher stream)~
  Returns cipher suite name

- ~(:cipher-bits stream)~ or ~(tls-stream/cipher-bits stream)~
  Returns cipher bit strength as integer

*** Session Management

- ~(:session-reused? stream)~ or ~(tls-stream/session-reused? stream)~
  Returns ~true~ if session was resumed

- ~(:get-session stream)~ or ~(tls-stream/get-session stream)~
  Returns session data (byte string) for resumption

- ~(:set-session stream data)~ or ~(tls-stream/set-session stream data)~
  Sets session data (usually passed in ~connect~ options instead)

*** TLS Operations

- ~(:key-update stream)~ or ~(tls-stream/key-update stream)~
  Request TLS 1.3 key update (post-handshake key rotation)

- ~(:renegotiate stream)~ or ~(tls-stream/renegotiate stream)~
  Request TLS 1.2 renegotiation (disabled by default for security)

- ~(:set-ocsp-response stream data)~ or ~(tls-stream/set-ocsp-response stream data)~
  Set OCSP stapling response

- ~(:shutdown stream &opt force)~ or ~(tls-stream/shutdown stream &opt force)~
  Perform TLS shutdown. If ~force~ is true, skip close_notify.

*** Certificate Trust

- ~(tls-stream/trust-cert ctx cert-pem)~
  Add a trusted certificate to a context. Used for trusting self-signed certs.

*Example*: See [[file:../examples/session_resumption.janet][session_resumption.janet]] for session management.
*Example*: See [[file:../examples/tls_key_update.janet][tls_key_update.janet]] for key update usage.
*Example*: See [[file:../examples/connection_info.janet][connection_info.janet]] for connection info retrieval.

* Module: jsec/dtls

DTLS provides TLS security for UDP datagrams. The API design:

- *Server-side*: Follows Janet's UDP conventions (~net/recv-from~, ~net/send-to~)
  for multiplexed peer handling on a single socket.
- *Client-side*: 1:1 connections with stream-like ~read~/~write~ for simplicity.

Both DTLSServer and DTLSClient embed JanetStream and expose methods via the
standard ~(:method obj args...)~ syntax, matching Janet's stream patterns.

** Stream Method Access

Both DTLSServer and DTLSClient support method dispatch:

#+begin_src janet
# Server methods
(:recv-from server nbytes buf)
(:send-to server addr data)
(:close server)
(:localname server)

# Client methods  
(:read client nbytes)
(:write client data)
(:close client)
#+end_src

** Server API (UDP-style, multiple peers)

*** (dtls/listen host port &opt opts)

Create a DTLS server bound to an address.

- *host*: Bind address (string)
- *port*: Bind port (integer or string)
- *opts*: Table
  - ~:cert~: Server certificate (PEM string). *Required*.
  - ~:key~: Server private key (PEM string). *Required*.
  - ~:verify~: Boolean (default ~false~). Request client certificates (mTLS).
  - ~:ca~: CA certificates for client verification.
  - ~:session-timeout~: Session timeout in seconds (default 300).

*Returns*: A DTLS server object.

*** (dtls/recv-from server nbytes buf &opt timeout-or-opts)

Receive a datagram from any peer. Handles DTLS handshakes transparently.

- *server*: DTLS server object
- *nbytes*: Maximum bytes to receive
- *buf*: Buffer to receive data into
- *timeout-or-opts*: Number (timeout in seconds) or table ~{:timeout n}~

*Returns*: Peer address object, or ~nil~ on timeout.

Matches Janet's ~net/recv-from~ convention.

*** (dtls/send-to server addr data &opt timeout)

Send a datagram to a specific peer.

- *server*: DTLS server object
- *addr*: Peer address (from ~recv-from~)
- *data*: Data to send (string or buffer)
- *timeout*: Optional timeout in seconds

*Returns*: Number of bytes sent.

*** (dtls/close-server server &opt force)

Close the server and all sessions.

- *server*: DTLS server object
- *force*: If true, skip close_notify alerts (default false)

*** (dtls/localname server)

Get the local address the server is bound to.

*Returns*: ~[host port]~ tuple.

** Client API (1:1 connection)

*** (dtls/connect host port &opt opts)

Create a DTLS client connection. Performs handshake.

- *host*: String (hostname or IP address)
- *port*: Integer or string (port number)
- *opts*: Optional table
  - ~:verify~: Boolean (default ~true~). Verify server certificate.
  - ~:cert~: Client certificate for mTLS (PEM string).
  - ~:key~: Client private key for mTLS (PEM string).
  - ~:ca~: CA certificate (PEM string).
  - ~:sni~: Server name for SNI (defaults to host).
  - ~:verify-hostname~: Hostname to verify against cert.
  - ~:handshake-timing~: Boolean. Track handshake duration.

*Returns*: A DTLS client object.

*** (dtls/read client n &opt buf timeout)

Read a datagram from the connection.

- *client*: DTLS client object
- *n*: Maximum bytes to read
- *buf*: Optional buffer to read into
- *timeout*: Optional timeout in seconds

*Returns*: Buffer with data, or ~nil~ on EOF.

*** (dtls/write client data &opt timeout)

Write a datagram to the connection.

- *client*: DTLS client object
- *data*: Data to send (string or buffer)
- *timeout*: Optional timeout in seconds

*Returns*: Number of bytes written.

*** (dtls/close client &opt force)

Close the client connection.

- *client*: DTLS client object
- *force*: If true, skip close_notify (default false)

** Address Utilities

- ~(dtls-stream/address host port)~: Create an address object.
- ~(dtls-stream/address-host addr)~: Get host string from address.
- ~(dtls-stream/address-port addr)~: Get port number from address.
- ~(dtls-stream/address? x)~: Check if x is a DTLS address object.

** DTLS Stream Methods (via jsec/dtls-stream)

These methods are available on DTLS server and client objects. Access via method
syntax ~(:method obj args...)~ or import ~jsec/dtls-stream~ for function versions.

*** Connection Information (Client)

- ~(:connection-info client)~ or ~(dtls-stream/connection-info client)~
  Returns a struct with connection details:
  - ~:version~: DTLS version (e.g., "DTLSv1.2")
  - ~:cipher~: Cipher suite name
  - ~:cipher-bits~: Cipher strength

- ~(:version client)~ or ~(dtls-stream/version client)~
  Returns DTLS version string

- ~(:cipher client)~ or ~(dtls-stream/cipher client)~
  Returns cipher suite name

- ~(:cipher-bits client)~ or ~(dtls-stream/cipher-bits client)~
  Returns cipher bit strength

- ~(:peername client)~ or ~(dtls-stream/peername client)~
  Returns peer address as ~[host port]~ tuple

*** Session Management (Client)

- ~(:session-reused? client)~ or ~(dtls-stream/session-reused? client)~
  Returns ~true~ if session was resumed

- ~(:get-session client)~ or ~(dtls-stream/get-session client)~
  Returns session data for resumption

- ~(:set-session client data)~ or ~(dtls-stream/set-session client data)~
  Sets session data

