docs/API.org
*** (crypto/cms-encrypt data certs &opt opts)

Encrypt data for recipients using CMS.

- *data*: Data to encrypt
- *certs*: Array of recipient certificates (PEM)
- *opts*: Optional table
  - ~:cipher~: Cipher to use (default "aes-256-cbc")

*Returns*: CMS encrypted data.

*** (crypto/cms-decrypt cms-data cert key)

Decrypt CMS encrypted data.

- *cms-data*: Encrypted CMS data
- *cert*: Recipient certificate (PEM)
- *key*: Recipient private key (PEM)

*Returns*: Decrypted data buffer.

*** (crypto/cms-certs-only certs)

Create a CMS certs-only message (certificate chain).

- *certs*: Array of certificates (PEM)

*Returns*: CMS data containing certificates.

*** (crypto/cms-get-certs cms-data)

Extract certificates from CMS data.

- *cms-data*: CMS signed or certs-only data

*Returns*: Array of PEM-encoded certificates.

** Base64 Encoding

*** (crypto/base64-encode data)

Base64 encode data.

*Returns*: Base64 string.

*** (crypto/base64-decode data)

Base64 decode data.

*Returns*: Decoded buffer.

*** (crypto/base64url-encode data)

URL-safe Base64 encode (for JWT, etc.).

*Returns*: Base64url string.

*** (crypto/base64url-decode data)

URL-safe Base64 decode.

*Returns*: Decoded buffer.

*Example*: See [[file:../examples/crypto_signing.janet][crypto_signing.janet]] for signing operations.
*Example*: See [[file:../examples/crypto_operations.janet][crypto_operations.janet]] for comprehensive crypto usage.

** Symmetric Encryption (AEAD)

*** (crypto/encrypt algo key nonce plaintext &opt aad)

Encrypt data using authenticated encryption (AEAD).

- *algo*: Cipher algorithm keyword
  - ~:aes-128-gcm~ - AES-128 in GCM mode (16-byte key, 12-byte nonce)
  - ~:aes-256-gcm~ - AES-256 in GCM mode (32-byte key, 12-byte nonce)
  - ~:chacha20-poly1305~ - ChaCha20-Poly1305 (32-byte key, 12-byte nonce)
  - ~:aes-128-cbc~ - AES-128 in CBC mode (16-byte key, 16-byte IV)
  - ~:aes-256-cbc~ - AES-256 in CBC mode (32-byte key, 16-byte IV)
- *key*: Encryption key (buffer, correct length for algorithm)
- *nonce*: Nonce/IV (buffer, correct length for algorithm)
- *plaintext*: Data to encrypt
- *aad*: Optional additional authenticated data (AEAD only)

*Returns*: Struct ~{:ciphertext <buffer> :tag <buffer>}~

*IMPORTANT*: Never reuse a nonce with the same key!

*** (crypto/decrypt algo key nonce ciphertext tag &opt aad)

Decrypt data using authenticated encryption.

- *algo*: Same as encrypt
- *key*: Encryption key
- *nonce*: Same nonce used for encryption
- *ciphertext*: Encrypted data
- *tag*: Authentication tag (required for AEAD, nil for CBC)
- *aad*: Must match AAD used during encryption

*Returns*: Decrypted plaintext buffer.

*Errors*: If authentication fails (tag mismatch).

*** (crypto/generate-nonce algo)

Generate a random nonce suitable for the specified cipher.

- *algo*: Cipher algorithm keyword

*Returns*: Buffer of appropriate length.

*** (crypto/cipher-info algo)

Get information about a cipher algorithm.

- *algo*: Cipher algorithm keyword

*Returns*: Struct with cipher details:
- ~:name~ - Algorithm name
- ~:key-length~ - Required key length in bytes
- ~:nonce-length~ - Required nonce/IV length in bytes
- ~:tag-length~ - Authentication tag length (AEAD)
- ~:aead~ - Boolean indicating if cipher is AEAD

*Example*: See [[file:../examples/symmetric_encryption.janet][symmetric_encryption.janet]] for AEAD encryption.

** RSA Encryption

*** (crypto/rsa-encrypt key-pem plaintext &opt opts)

Encrypt data with RSA public key.

- *key-pem*: Public or private key in PEM format
- *plaintext*: Data to encrypt
- *opts*: Optional table
  - ~:padding~ - Padding mode (default ~:oaep-sha256~)
    - ~:oaep-sha256~ (recommended)
    - ~:oaep-sha384~
    - ~:oaep-sha512~
    - ~:oaep-sha1~ (legacy)
    - ~:pkcs1~ (legacy, NOT recommended)

*Returns*: Encrypted ciphertext buffer.

*Note*: RSA can only encrypt limited data based on key size and padding.
Use ~rsa-max-plaintext~ to check limits. For larger data, use hybrid encryption.

*** (crypto/rsa-decrypt key-pem ciphertext &opt opts)

Decrypt data with RSA private key.

- *key-pem*: Private key in PEM format
- *ciphertext*: Encrypted data
- *opts*: Must match encryption options

*Returns*: Decrypted plaintext buffer.

*** (crypto/rsa-max-plaintext key-pem &opt opts)

Get maximum plaintext size for RSA encryption.

- *key-pem*: Key in PEM format
- *opts*: Same as rsa-encrypt

*Returns*: Maximum bytes that can be encrypted.

*Example*: See [[file:../examples/rsa_encryption.janet][rsa_encryption.janet]] for RSA encryption and hybrid encryption.

** Key/Certificate Format Conversion

*** (crypto/convert-key key-data target-format &opt opts)

Convert a key between formats.

- *key-data*: Key in any supported format
- *target-format*: Keyword
  - ~:pem~ - PEM format
  - ~:der~ - DER (binary) format
  - ~:pkcs8~ - PKCS#8 PEM format
  - ~:pkcs8-der~ - PKCS#8 DER format
- *opts*: Optional table
  - ~:password~ - Password for encrypted PKCS#8 output

*Returns*: Key in target format.

*** (crypto/convert-cert cert-data target-format)

Convert a certificate between PEM and DER formats.

- *cert-data*: Certificate data
- *target-format*: ~:pem~ or ~:der~

*Returns*: Certificate in target format.

*** (crypto/detect-format data)

Detect if data is PEM or DER format.

*Returns*: ~:pem~ or ~:der~

*** (crypto/load-key key-pem &opt password)

Load a private key, optionally decrypting it.

- *key-pem*: Key in PEM format
- *password*: Password if key is encrypted

*Returns*: Decrypted key in PEM format.

*** (crypto/export-key key-pem &opt opts)

Export a private key, optionally encrypting it.

- *key-pem*: Key in PEM format
- *opts*: Optional table
  - ~:password~ - Password for encryption
  - ~:cipher~ - Encryption cipher (~:aes-256-cbc~, ~:aes-128-cbc~, ~:des-ede3-cbc~)

*Returns*: Key in PEM format.

*** (crypto/key-info key-pem)

Get metadata about a key without needing the password.

*Returns*: Table with:
- ~:type~ - ~:rsa~, ~:ec~, ~:ed25519~, ~:x25519~, etc.
- ~:bits~ - Key size in bits
- ~:curve~ - EC curve name (for EC keys)
- ~:encrypted~ - True if password-protected

*Example*: See [[file:../examples/format_conversion.janet][format_conversion.janet]] for format conversion.

** PKCS#12 Operations

*** (crypto/create-pkcs12 cert-pem key-pem opts)

Create a PKCS#12 (PFX) bundle.

- *cert-pem*: Certificate in PEM format
- *key-pem*: Private key in PEM format
- *opts*: Table
  - ~:password~ - Required password for bundle
  - ~:chain~ - Optional array of CA certificate PEMs
  - ~:friendly-name~ - Optional friendly name attribute

*Returns*: PKCS#12 bundle bytes (DER format).

*** (crypto/parse-pkcs12 pfx-data password)

Parse a PKCS#12 bundle.

- *pfx-data*: PKCS#12 data (from file or create-pkcs12)
- *password*: Bundle password

*Returns*: Table with:
- ~:cert~ - Certificate PEM
- ~:key~ - Private key PEM
- ~:chain~ - Array of CA certificate PEMs
- ~:friendly-name~ - Friendly name if present

*Example*: See [[file:../examples/pkcs12_operations.janet][pkcs12_operations.janet]] for PKCS#12 usage.

** Elliptic Curve Point Operations

Low-level EC point arithmetic for custom protocols, threshold cryptography,
zero-knowledge proofs, and Bitcoin/Ethereum cryptography.

